export const rules = {
  email: [
    (v) => {
      if (!v) {
        return "Обязательное поле";
      } else {
        if (
          String(v)
            .toLowerCase()
            .match(
              /^(([^<>()[\]\\.,;=\s@"]+(\.[^<>()[\]\\.,;=\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/
            )
        ) {
          return true;
        } else {
          return "Введите корректную почту";
        }
      }
    },
  ],
  password: [
    (v) => {
      if (!v) {
        return "Обязательное поле";
      } else {
        if (v.length > 5) {
          return true;
        } else {
          return "Введите корректный пароль. Длина пароля должна быть больше 5";
        }
      }
    },
  ],
  required: [(v) => !!v || "Поле не может быть пустым"],
};
